# Benjamin Michael Taylor (bentaylorhk)
# 2025

# List of pacman packages used by polyOS
# Can be installed with ~/scripts/update-polyos.sh

# Core
arch-install-scripts
base

# X and Window Manager
xorg-server
xorg-xinit
i3-wm
i3status
rofi

# Audio
pulseaudio
pulseaudio-alsa
pavucontrol

# UI Applications
alacritty
firefox
spotify-launcher

# CLI Tools
htop
less
lynx
tmux
lf

# C/C++
gcc
cmake
make
ninja

# Python
python
python-openai
python-pydantic
python-fastapi
python-redis
python-requests
python-rich
python-sqlalchemy

# Languages
ruby
rust
nodejs

# Editors
vim
neovim
nano

# LSPs/Linters/Formatters
tree-sitter-cli
luarocks
#TODO: is this not masons job?
luacheck

# Utils
autorandr
debugedit
fd
git
npm
openssh
ripgrep
sudo
unzip
which
zip
man
fakeroot
xclip

# Art/Decor
neofetch
