# Benjamin Michael Taylor (bentaylorhk)
# 2025

# List of pacman packages used by polyOS
# Can be installed with ~/scripts/update-polyos.sh

# Core
arch-install-scripts
base

# X and Window Manager
xorg-server
xorg-xinit
i3-wm
polybar
perl-anyevent-i3
rofi
xclip
xautolock

# Audio (pipewire with pulse interface)
pipewire
pipewire-pulse 
pipewire-alsa 
pipewire-jack
pavucontrol

# GUI Applications
alacritty
firefox
spotify-launcher
feh

# CLI Tools
htop
less
lynx
tmux
lf

# C/C++
gcc
cmake
make
ninja

# Python
python
python-openai
python-pydantic
python-fastapi
python-redis
python-requests
python-rich
python-sqlalchemy
python-neovim

# Languages
ruby
rust
nodejs
go
jdk-openjdk
julia
php
composer
lua

# Editors
vim
neovim
nano

# LSPs/Linters/Formatters
tree-sitter-cli
nix

# LaTeX
texlive-basic
texlive-latex
texlive-fontsrecommended
texlive-latexrecommended
texlive-latexextra
texlive-pictures
texlive-pstricks
texlive-binextra
biber

# Utils
debugedit
fd
git
npm
openssh
ripgrep
sudo
unzip
which
zip
man
fakeroot
wget
lazygit
autorandr
imagemagick
kitty
fzf
