# Benjamin Michael Taylor (bentaylorhk)
# 2025

# List of pacman packages used by polyOS
# Can be installed with ~/scripts/update-polyos.sh

# Core
arch-install-scripts
base

# CLI Tools
htop
less
lynx
tmux

# C/C++
gcc
cmake
make
ninja

# Python
python
python-openai
python-pydantic
python-fastapi
python-redis
python-requests
python-sqlalchemy

# Languages
ruby
rust
nodejs

# Editors
vim
neovim
nano

# LSPs/Linters/Formatters
tree-sitter-cli
luarocks

# Utils
autorandr
debugedit
fd
git
npm
openssh
ripgrep
sudo
unzip
which
zip

# Art/Decor
neofetch
